W14/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
	( 0 	-2.5 	0)	//0
	( 2.2	-2.5	0)	//1
	(  3.8	-2.5	0)	//2
	(  6	-2.5	0)	//3
	(  6	-0.8	0)	//4
	(  3.8	-0.8	0)	//5
	( 2.2	-0.8	0)	//6
	( 0	-0.8	0)	//7

	( 0	-2.5 	0.5)	//8 
	( 2.2	-2.5	0.5)  //9
	(  3.8	-2.5	0.5)	//10
	(  6	-2.5	0.5)	//11
	(  6	-0.8	0.5)	//12
	(  3.8	-0.8	0.5)	//13
	( 2.2	-0.8	0.5)	//14
	( 0	-0.8	0.5)	//15

	( 0	-2.5	 1.3)	//16
	( 2.2	-2.5	 1.3)	//17
	(  3.8	-2.5	 1.3)	//18
	(  6	-2.5	 1.3)	//19
	(  6	-0.8	 1.3)	//20
	(  3.8	-0.8	 1.3)	//21
	( 2.2	-0.8	 1.3)	//22
	( 0	-0.8	 1.3)	//23

	( 0	-2.5	 1.35)	//24
	( 2.2	-2.5	 1.35)	//25
	(  3.8	-2.5	 1.35)	//26
	(  6	-2.5	 1.35)	//27
	(  6	-0.8	 1.35)	//28
	(  3.8	-0.8	 1.35)	//29
	( 2.2	-0.8	 1.35)	//30
	( 0	-0.8	 1.35)	//31
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Using second index number
    ( 0	0.8 0)	//64	32
	( 2.2	0.8	0)	//65	33
	(  3.8	0.8	0)	//66	34
	(  6	0.8	0)	//67	35
	(  6	2.5	0)	//68	36
	(  3.8	2.5	0)	//69	37
	( 2.2	2.5	0)	//70	38
	( 0	2.5	0)	//71	39

	( 0	0.8 0.5)	//72	40
	( 2.2	0.8	0.5)  //73	41
	(  3.8	0.8	0.5)	//74	42
	(  6	0.8	0.5)	//75	43
	(  6	2.5	0.5)	//76	44
	(  3.8	2.5	0.5)	//77	45
	( 2.2	2.5	0.5)	//78	46
	( 0	2.5	0.5)	//79	47

	( 0	0.8	 1.3)	//80	48
	( 2.2	0.8	 1.3)	//81	49
	(  3.8	0.8	 1.3)	//82	50
	(  6	0.8	 1.3)	//83	51
	(  6	2.5	 1.3)	//84	52
	(  3.8	2.5	 1.3)	//85	53
	( 2.2	2.5	 1.3)	//86	54
	( 0	2.5	 1.3)	//87	55

	( 0	0.8	 1.35)	//88	56
	( 2.2	0.8	 1.35)	//89	57
	(  3.8	0.8	 1.35)	//90	58
	(  6	0.8	 1.35)	//91	59
	(  6	2.5	 1.35)	//92	60
	(  3.8	2.5	 1.35)	//93	61
	( 2.2	2.5	 1.35)	//94	62
	( 0	2.5	 1.35)	//95	63

	(  12	-2.5	0)	//64
	(  12	-0.8	0)  //65
	(  12	-2.5	0.5)	//66
	(  12	-0.8	0.5)	//67
	(  12	-2.5	 1.3)	//68
	(  12	-0.8	 1.3)	//69
	(  12	-2.5	 1.35)	//70
	(  12	-0.8	 1.35)	//71
	(  12	0.8		0)	//72
	(  12	2.5		0)  //73
	(  12	0.8		0.5)	//74
	(  12	2.5		0.5)	//75
	(  12	0.8		 1.3)	//76
	(  12	2.5		 1.3)	//77
	(  12	0.8		 1.35)	//78
	(  12	2.5		 1.35)	//79



);
blocks
(
hex (0 1 6 7 8 9 14 15) (76 59 17) simpleGrading (0.5 0.5 0.5)		//b0
hex (1 2 5 6 9 10 13 14) (80 59 17) simpleGrading (1 0.5 0.5)	  	//b1
hex (2 3 4 5 10 11 12 13) (76 59 17) simpleGrading (2 0.5 0.5)		//b2

hex (8 9 14 15 16 17 22 23) (76 59 40) simpleGrading (0.5 0.5 1)	//b3
hex (9 10 13 14 17 18 21 22) (80 59 40) simpleGrading (1 0.5 1)		//b4 *
hex (10 11 12 13 18 19 20 21) (76 59 40) simpleGrading (2 0.5 1)	//b5

hex (16 17 22 23 24 25 30 31) (76 59 2) simpleGrading (0.5 0.5 1)	//b6	
hex (17 18 21 22 25 26 29 30) (80 59 2) simpleGrading (1 0.5 1)	//b7
hex (18 19 20 21 26 27 28 29) (76 59 2) simpleGrading (2 0.5 1)	//b8

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

hex (7 6 33 32 15 14 41 40) (76 80 17) simpleGrading (0.5 1 0.5)	//b9
hex (6 5 34 33 14 13 42 41) (80 80 17) simpleGrading (1 1 0.5)	//b10
hex (5 4 35 34 13 12 43 42) (76 80 17) simpleGrading (2 1 0.5)	//b11

hex (15 14 41 40 23 22 49 48) (76 80 40) simpleGrading (0.5 1 1)	//b12
hex (14 13 42 41 22 21 50 49) (80 80 40) simpleGrading (1 1 1)	//b13 *
hex (13 12 43 42 21 20 51 50) (76 80 40) simpleGrading (2 1 1)	//b14

hex (23 22 49 48 31 30 57 56) (76 80 2) simpleGrading (0.5 1 1)	//b15	
hex (22 21 50 49 30 29 58 57) (80 80 2) simpleGrading (1 1 1)	//b16
hex (21 20 51 50 29 28 59 58) (76 80 2) simpleGrading (2 1 1)	//b17

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

hex (32 33 38 39 40 41 46 47) (76 59 17) simpleGrading (0.5 2 0.5)	//b18
hex (33 34 37 38 41 42 45 46) (80 59 17) simpleGrading (1 2 0.5)	//b19
hex (34 35 36 37 42 43 44 45) (76 59 17) simpleGrading (2 2 0.5)	//b20

hex (40 41 46 47 48 49 54 55) (76 59 40) simpleGrading (0.5 2 1)	//b21
hex (41 42 45 46 49 50 53 54) (80 59 40) simpleGrading (1 2 1)	//b22 *
hex (42 43 44 45 50 51 52 53) (76 59 40) simpleGrading (2 2 1)	//b23

hex (48 49 54 55 56 57 62 63) (76 59 2) simpleGrading (0.5 2 1)	//b24	
hex (49 50 53 54 57 58 61 62) (80 59 2) simpleGrading (1 2 1)	//b25
hex (50 51 52 53 58 59 60 61) (76 59 2) simpleGrading (2 2 1)	//b26

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

hex (3 64 65 4 11 66 67 12 ) (100 59 17 ) simpleGrading (1 0.5 0.5)
hex (11 66 67 12 19 68 69 20) (100 59 40) simpleGrading (1 0.5 1)
hex (19 68 69 20 27 70 71 28) (100 59 2) simpleGrading (1 0.5 1)

hex (4 65 72 35 12 67 74 43) (100 80 17) simpleGrading (1 1 0.5)
hex (12 67 74 43 20 69 76 51) (100 80 40) simpleGrading (1 1 1)
hex (20 69 76 51 28 71 78 59) (100 80 2) simpleGrading (1 1 1)

hex (35 72 73 36 43 74 75 44) (100 59 17) simpleGrading (1 2 0.5)
hex (43 74 75 44 51 76 77 52) (100 59 40) simpleGrading (1 2 1)
hex (51 76 77 52 59 78 79 60) (100 59 2) simpleGrading (1 2 1)

);

edges
(
);

boundary
(

    oversetPatch
    {
        type overset;
        faces ();
   }

    inlet
    {
        type patch;
        faces
        (
			(0	8	15	7)
			(8	16	23	15)
			(16	24	31	23)

			(7	15	40	32)
			(15	23	48	40)
			(23	31	56	48)

			(32	40	47	39)
			(40	48	55	47)
			(48	56	63	55)
			
        );
    }
	
    outlet
    {
        type patch;
        faces
        (
			(64 65 67 66)
            (66 67 69 68)
			(68 69 71 70)

			(65 72 74 67)
			(67 74 76 69)
			(69 76 78 71)

			(72 73 75 74)
			(74 75 77 76)
			(76 77 79 78)
        );
    }
	
    ground
    {
        type wall;
        faces
        (
			(0	7	6	1)
			(1	6	5	2)
			(2	5	4	3)
			
			(7	32	33	6)
			(6	33	34	5)
			(5	34	35	4)

			(32	39	38	33)
			(33	34	37	38)
			(34	37	35	36)

			(3 4 65 64)
			(4 35 72 65)
			(35 36 73 72)
			

        );
    }
	
	
    walls
    {
        type patch;
        faces
        (
			(0	1	9	8)
			(1	2	10	9)
			(2	3	11	10)

			(8	9	16	17)
			(9	10	18	17)
			(10	11	19	18)

			(16	17	25	24)
			(17	18	26	25)
			(18	19	27	26)	
			
			(3 64 66 11)
			(11 66 68 19)
			(19 68 70 27 )//front


			(38	39	47	46)
			(37	38	46	45)
			(36	37	45	44)

			(46	47	55	54)
			(45	46	54	53)
			(44	45	53	52)

			(54	55	63	62)
			(53	54	62	61)
			(52	53	61	60)	
			
			(73 36 44 75)
			(75 44 52 77)
			(77 52 60 79)//back
        );
    }
	
    atmosphere
    {
        type patch;
        faces
        (
			(24	25	30	31)
			(25	26	29	30)
			(26	27	28	29)

			(31	30	57	56)
			(30	29	58	57)
			(29	28	59	58)

			(56	57	62	63)
			(57	58	61	62)
			(58	59	60	61)

			(27 70 71 28)
			(28 71 78 59)
			(59 78 79 60)

			
        );
    }

    floatingObject
    {
        type wall;
        faces ();
    }
);

// ************************************************************************* //
